# School District Analysis

In [2]:
# Dependencies
import pandas as pd

In [3]:
# Files
school_csv = "Resources/schools_complete.csv"
student_csv = "Resources/students_complete.csv"

In [4]:
sch_data = pd.read_csv(school_csv)
stu_data = pd.read_csv(student_csv)

In [5]:
#Checked data / looked up for NA's 
sch_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
sch_data.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [8]:
stu_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [9]:
stu_data.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
# Combine the data into a single dataset.  
sch_stu_data = pd.merge(stu_data, sch_data, how="left", on=["school_name", "school_name"])

In [11]:
sch_stu_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

# District Summary

In [12]:
# Total schools
total_schools = sch_stu_data["School ID"].nunique()
total_schools

15

In [13]:
# Total students
total_students = sch_stu_data["Student ID"].nunique()
total_students

39170

In [26]:
# Total budget
total_budget = sch_data["budget"].sum()
total_budget

24649428

In [28]:
# Average math score
math_score_avg = round(sch_stu_data["math_score"].mean(),2)
math_score_avg

78.99

In [29]:
# Average reading score
reading_score_avg = round(sch_stu_data["reading_score"].mean(),2)
reading_score_avg

81.88

In [82]:
#
#function
def percent(parcial, total):
    prc = (parcial*100)/total
    return round(prc,2)

In [120]:
# as the guideline did not define what the pass grade is, I defined pass = 70 ((same results as starter))
pass_grade = 70

In [121]:
# % passing math (the percentage of students who passed math)
pass_math_column = sch_stu_data.loc[sch_stu_data["math_score"] >= pass_grade, "math_score"]
pass_math_cnt = pass_math_column.count()

In [122]:
pass_math_prc = percent(pass_math_cnt, total_students)
pass_math_prc

74.98

In [123]:
# % passing reading (the percentage of students who passed reading)
pass_reading_column = sch_stu_data.loc[sch_stu_data["reading_score"] >= pass_grade, "reading_score"]
pass_reading_cnt = pass_reading_column.count()

In [124]:
pass_reading_prc = percent(pass_reading_cnt, total_students)
pass_reading_prc

85.81

In [125]:
# % overall passing (the percentage of students who passed math AND reading)
pass_all_column = (sch_stu_data["math_score"] >= pass_grade) & (sch_stu_data["reading_score"] >= pass_grade)
pass_all = pass_all_column.value_counts()
pass_all

True     25528
False    13642
dtype: int64

In [126]:
# keep "True"
pass_all_cnt = pass_all[1]
pass_all_cnt

25528

In [127]:
pass_all_prc = percent(pass_all_cnt, total_students)
pass_all_prc

65.17

In [128]:
# Dataframe with the above results
district_summary = {
    "total_schools": [total_schools],
    "total_students": [total_students],
    "total_budget": [total_budget],
    "math_score_avg": [math_score_avg],
    "reading_score_avg": [reading_score_avg],
    "% passed math": [pass_math_prc],
    "% passed reading": [pass_reading_prc],
    "% passed math & read": [pass_all_prc]
}
district_summary

{'total_schools': [15],
 'total_students': [39170],
 'total_budget': [24649428],
 'math_score_avg': [78.99],
 'reading_score_avg': [81.88],
 '% passed math': [74.98],
 '% passed reading': [85.81],
 '% passed math & read': [65.17]}

### District Summary Results

In [129]:
# RESULTS
district_summary_df = pd.DataFrame(district_summary)
district_summary_df

,total_schools,total_students,total_budget,math_score_avg,reading_score_avg,% passed math,% passed reading,% passed math & read
0,15,39170,24649428,78.99,81.88,74.98,85.81,65.17

---------------------------------------------

# School Summary

---------------------------------------------

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [141]:
sch_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [142]:
stu_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [153]:
# Create new df with the columns that I need
# School Name, School Type, Total Students, Total School Budget
school_summary = pd.DataFrame(sch_data[["school_name","type","size","budget"]])

In [154]:
# rename them
school_summary = school_summary.rename(
    columns={
    "school_name":"School Name",
    "type":"School Type",
    "budget":"Total School Budget",
    "size":"Total Students"
})

In [155]:
# set index
school_summary.set_index("School Name", inplace=True)

In [158]:
#Per Student Budget
school_summary["Per Student Budget"] = (
    school_summary["Total School Budget"]/school_summary["Total Students"])

In [185]:
# group by
sch_groupby_data = sch_stu_data.groupby("school_name")    # .mean()
sch_groupby_data

In [172]:
#Average Math Score
school_summary["Average Math Score"] = (
    round(sch_groupby_data["math_score"].mean(),2))

In [174]:
#Average Reading Score
school_summary["Average Reading Score"] = (
    round(sch_groupby_data["reading_score"].mean(),2))

In [199]:
# % Passing Math
# count
pass_math_cnt_sch = sch_stu_data.loc[
    sch_stu_data["math_score"] >= pass_grade].groupby(["school_name"]).count()

In [201]:
#percent
school_summary["% Passing Math"] = percent(
    pass_math_cnt_sch["math_score"], school_summary["Total Students"])

In [206]:
# % Passing Reading
#count
pass_read_cnt_sch = sch_stu_data.loc[
    sch_stu_data["reading_score"] >= pass_grade].groupby(["school_name"]).count()

In [207]:
#percent
school_summary["% Passing Reading"] = percent(
    pass_read_cnt_sch["reading_score"], school_summary["Total Students"])

In [211]:
# % Overall Passing (The percentage of students that passed math and reading)
# count
pass_math_read_cnt_sch = sch_stu_data.loc[
    (sch_stu_data["math_score"] >= pass_grade) & (sch_stu_data["reading_score"] >= pass_grade)].groupby(
    ["school_name"]).count()

In [212]:
#percent
school_summary["% Overall Passing"] = percent(
    pass_math_read_cnt_sch["reading_score"], school_summary["Total Students"])

### School Summary Results

In [214]:
# dataframe to hold the above results
school_summary

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Huang High School,District,2917,1910635,655.0,76.63,81.18,65.68,81.32,53.51
Figueroa High School,District,2949,1884411,639.0,76.71,81.16,65.99,80.74,53.20
Shelton High School,Charter,1761,1056600,600.0,83.36,83.73,93.87,95.85,89.89
Hernandez High School,District,4635,3022020,652.0,77.29,80.93,66.75,80.86,53.53
Griffin High School,Charter,1468,917500,625.0,83.35,83.82,93.39,97.14,90.60
Wilson High School,Charter,2283,1319574,578.0,83.27,83.99,93.87,96.54,90.58
Cabrera High School,Charter,1858,1081356,582.0,83.06,83.98,94.13,97.04,91.33
Bailey High School,District,4976,3124928,628.0,77.05,81.03,66.68,81.93,54.64
Holden High School,Charter,427,248087,581.0,83.80,83.81,92.51,96.25,89.23
Pena High School,Charter,962,585858,609.0,83.84,84.04,94.59,95.95,90.54
Wright High School,Charter,1800,1049400,583.0,83.68,83.96,93.33,96.61,90.33
Rodriguez High School,District,3999,2547363,637.0,76.84,80.74,66.37,80.22,52.99
Johnson High School,District,4761,3094650,650.0,77.07,80.97,66.06,81.22,53.54
Ford High School,District,2739,1763916,644.0,77.10,80.75,68.31,79.30,54.29
Thomas High School,Charter,1635,1043130,638.0,83.42,83.85,93.27,97.31,90.95

--------------------------------------------------------

# Top Performing Schools (By % Overall Passing)

----------------------------

In [221]:
# Sort and display the top five performing schools by % overall passing.
school_summary_top = school_summary.sort_values("% Overall Passing",ascending=False)
school_summary_top.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Cabrera High School,Charter,1858,1081356,582.0,83.06,83.98,94.13,97.04,91.33
Thomas High School,Charter,1635,1043130,638.0,83.42,83.85,93.27,97.31,90.95
Griffin High School,Charter,1468,917500,625.0,83.35,83.82,93.39,97.14,90.60
Wilson High School,Charter,2283,1319574,578.0,83.27,83.99,93.87,96.54,90.58
Pena High School,Charter,962,585858,609.0,83.84,84.04,94.59,95.95,90.54

-------------------------

# Lowest-Performing Schools (by % Overall Passing)
DataFrame that highlights the bottom 5 performing schools based on % Overall Passing.

--------------------

In [222]:
# sort
school_summary_lowest = school_summary.sort_values("% Overall Passing")
school_summary_lowest.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,,,,
Rodriguez High School,District,3999,2547363,637.0,76.84,80.74,66.37,80.22,52.99
Figueroa High School,District,2949,1884411,639.0,76.71,81.16,65.99,80.74,53.20
Huang High School,District,2917,1910635,655.0,76.63,81.18,65.68,81.32,53.51
Hernandez High School,District,4635,3022020,652.0,77.29,80.93,66.75,80.86,53.53
Johnson High School,District,4761,3094650,650.0,77.07,80.97,66.06,81.22,53.54

-------------

# Math Scores by Grade
DataFrame that lists the average math score for students of each grade level (9th, 10th, 11th, 12th) at each school.

-----------------------------

In [237]:
# group by school and grade + mean
stu_mean = round(stu_data.groupby(by=["school_name","grade"]).mean(),2)
stu_mean.head(4)

                          Student ID  reading_score  math_score
school_name        grade
Bailey High School 10th     20365.06          80.91       77.00
                   11th     20345.15          80.95       77.52
                   12th     20386.72          80.91       76.49
                   9th      20344.48          81.30       77.08

In [236]:
#keep math scores
math_scores_bygrade = pd.DataFrame(stu_mean["math_score"])
math_scores_bygrade.head(12)

                            math_score
school_name          grade
Bailey High School   10th        77.00
                     11th        77.52
                     12th        76.49
                     9th         77.08
Cabrera High School  10th        83.15
                     11th        82.77
                     12th        83.28
                     9th         83.09
Figueroa High School 10th        76.54
                     11th        76.88
                     12th        77.15
                     9th         76.40

-------------

# Reading Scores by Grade
DataFrame that lists the average reading score for students of each grade level (9th, 10th, 11th, 12th) at each school.

--------------

In [238]:
#keep reading scores
read_scores_bygrade = pd.DataFrame(stu_mean["reading_score"])
read_scores_bygrade.head(12)

                            reading_score
school_name          grade
Bailey High School   10th           80.91
                     11th           80.95
                     12th           80.91
                     9th            81.30
Cabrera High School  10th           84.25
                     11th           83.79
                     12th           84.29
                     9th            83.68
Figueroa High School 10th           81.41
                     11th           80.64
                     12th           81.38
                     9th            81.20

---------------

# Scores by School Spending
Table that breaks down school performance based on average spending ranges (per student). 
Created four bins with cutoff values to group school spending.
* Average math score
* Average reading score
* % passing math (the percentage of students who passed math)
* % passing reading (the percentage of students who passed reading)
* % overall passing (the percentage of students who passed math AND reading)

----------------

In [265]:
# Per Student Budget distribution
dist_per_stu = round(school_summary["Per Student Budget"].describe(),2)
dist_per_stu

count     15.00
mean     620.07
std       28.54
min      578.00
25%      591.50
50%      628.00
75%      641.50
max      655.00
Name: Per Student Budget, dtype: float64

In [272]:
#bins and labels
budget_bins = [dist_per_stu["min"],dist_per_stu["25%"],dist_per_stu["50%"],
               dist_per_stu["75%"],dist_per_stu["max"]]
budget_bins

[578.0, 591.5, 628.0, 641.5, 655.0]

In [273]:
budget_labels = ["lowest", "low", "medium", "high"]

In [271]:
# keep columns I need
school_summary_scores = pd.DataFrame(
    school_summary[["Per Student Budget","Average Math Score","Average Reading Score",
                    "% Passing Math","% Passing Reading","% Overall Passing"]])
school_summary_scores.head(1)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Huang High School,655.0,76.63,81.18,65.68,81.32,53.51

In [276]:
# cut 
sch_scores_by_budget = school_summary_scores
sch_scores_by_budget["Spending Ranges"] = pd.cut(
    sch_scores_by_budget["Per Student Budget"],budget_bins,labels=budget_labels,include_lowest=True)

### Result table with Scores by School Spending

In [293]:
# group by spending + mean
sch_scores_by_budget = round(sch_scores_by_budget.groupby("Spending Ranges").mean(),2)
sch_scores_by_budget

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Ranges,,,,,,
lowest,581.00,83.45,83.94,93.46,96.61,90.37
low,615.50,81.90,83.16,87.13,92.72,81.42
medium,638.00,78.99,81.92,75.21,86.09,65.71
high,650.25,77.02,80.96,66.70,80.68,53.72

### Test by school

In [267]:
# lowest
school_summary_lowest = school_summary_scores.loc[
    school_summary_scores["Per Student Budget"] <= dist_per_stu["25%"], :]
school_summary_lowest

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Wilson High School,578.0,83.27,83.99,93.87,96.54,90.58
Cabrera High School,582.0,83.06,83.98,94.13,97.04,91.33
Holden High School,581.0,83.80,83.81,92.51,96.25,89.23
Wright High School,583.0,83.68,83.96,93.33,96.61,90.33

In [268]:
# low 
school_summary_low = school_summary_scores.loc[
    (school_summary_scores["Per Student Budget"] > dist_per_stu["25%"]) 
    & (school_summary_scores["Per Student Budget"] <= dist_per_stu["50%"]), :]
school_summary_low

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Shelton High School,600.0,83.36,83.73,93.87,95.85,89.89
Griffin High School,625.0,83.35,83.82,93.39,97.14,90.60
Bailey High School,628.0,77.05,81.03,66.68,81.93,54.64
Pena High School,609.0,83.84,84.04,94.59,95.95,90.54

In [269]:
# medium
school_summary_medium = school_summary_scores.loc[
    (school_summary_scores["Per Student Budget"] > dist_per_stu["50%"]) 
    & (school_summary_scores["Per Student Budget"] <= dist_per_stu["75%"]), :]
school_summary_medium

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Figueroa High School,639.0,76.71,81.16,65.99,80.74,53.20
Rodriguez High School,637.0,76.84,80.74,66.37,80.22,52.99
Thomas High School,638.0,83.42,83.85,93.27,97.31,90.95

In [270]:
# high
school_summary_high = school_summary_scores.loc[
    (school_summary_scores["Per Student Budget"] > dist_per_stu["75%"]), :]
school_summary_high

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Huang High School,655.0,76.63,81.18,65.68,81.32,53.51
Hernandez High School,652.0,77.29,80.93,66.75,80.86,53.53
Johnson High School,650.0,77.07,80.97,66.06,81.22,53.54
Ford High School,644.0,77.10,80.75,68.31,79.30,54.29

-----------------

# Scores by School Size
Table that breaks down school performance based on school size (small, medium, or large).

------------------

In [287]:
# Size distribution
dist_size_sch = round(school_summary["Total Students"].describe(),2)
dist_size_sch

count      15.00
mean     2611.33
std      1420.92
min       427.00
25%      1698.00
50%      2283.00
75%      3474.00
max      4976.00
Name: Total Students, dtype: float64

In [298]:
#bins and labels
size_bins = [dist_size_sch["min"],dist_size_sch["25%"],
               dist_size_sch["75%"],dist_size_sch["max"]]
size_labels = ["small", "medium", "large"]

In [299]:
sch_size_scores = pd.DataFrame(
    school_summary[["Total Students","Average Math Score","Average Reading Score",
                    "% Passing Math","% Passing Reading","% Overall Passing"]])
sch_size_scores.head(1)

,Total Students,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Name,,,,,,
Huang High School,2917,76.63,81.18,65.68,81.32,53.51

In [300]:
sch_size_scores = sch_size_scores.rename(columns={
    "Total Students":"School Size"
})

In [301]:
# cut 
sch_size_scores["School Size"] = pd.cut(
    sch_size_scores["School Size"],size_bins,labels=size_labels,include_lowest=True)

### Result table with Scores by School Size

In [302]:
# group by spending + mean
sch_scores_by_size = round(sch_size_scores.groupby("School Size").mean(),2)
sch_scores_by_size

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
small,83.60,83.88,93.44,96.66,90.33
medium,80.54,82.68,82.17,89.63,74.73
large,77.06,80.92,66.46,81.06,53.68

--------------------------------

# Scores by School Type
Table that breaks down school performance based on type of school (district or charter).

---------------------------------------

In [307]:
sch_type_scores = pd.DataFrame(
    school_summary[["School Type","Average Math Score","Average Reading Score",
                    "% Passing Math","% Passing Reading","% Overall Passing"]])

In [306]:
sch_type_scores = round(sch_type_scores.groupby("School Type").mean(),2)
sch_type_scores

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.47,83.90,93.62,96.59,90.43
District,76.96,80.97,66.55,80.80,53.67

---------------------------

Analysis by Diana Fernndez